Certification/src/Documents/ПриглашениеДляРегистрации/ПриглашениеДляРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриглашениеДляРегистрации</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПриглашения</name>
    <type>
      <types>EnumRef.ВидыПриглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживающаяОрганизация</name>
    <type>
      <types>CatalogRef.ОбслуживающиеОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>CatalogRef.Сервисы</types>
    </type>
  </attributes>
</mdclass:Document>

Certification/src/Enums/ВидыПриглашений/ВидыПриглашений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПриглашений</name>
  <enumValues>
    <name>Менеджеру</name>
  </enumValues>
  <enumValues>
    <name>Консультанту</name>
  </enumValues>
  <enumValues>
    <name>Эксперту</name>
  </enumValues>
</mdclass:Enum>

Certification/src/Catalogs/ОбслуживающиеОрганизации/ОбслуживающиеОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбслуживающиеОрганизации</name>
  <predefined>
    <items>
      <name>СлужбаПоддержки</name>
      <description>Служба поддержки</description>
    </items>
  </predefined>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаКонсультантов</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаМенеджеров</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЭкспертов</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяЛинияПоддержки</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонениеОтУниверсальногоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеСервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеКомпоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Certification/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Почасовка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОБД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID_УРВ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Certification/src/Documents/ПриглашениеДляРегистрации/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ОбслуживающаяОрганизация = Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки Тогда
		Элементы.ВидПриглашения.СписокВыбора.Добавить(Перечисления.ВидыПриглашений.Эксперту);
	КонецЕсли; 
	
	ДоступноИзменениеСвойствПользователя = Не ЗначениеЗаполнено(Объект.Пользователь);
	
	Элементы.ПолноеИмяПользователя.ТолькоПросмотр = Не ДоступноИзменениеСвойствПользователя;
	Элементы.АдресЭлектроннойПочты.ТолькоПросмотр = Не ДоступноИзменениеСвойствПользователя;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПриглашение(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	ОтправитьПриглашениеНаСервере();
	Оповещение = Новый ОписаниеОповещения("ОтправитьПриглашениеЗавершение", ЭтотОбъект);
	
	ПоказатьПредупреждение(Оповещение, НСтр("ru='Приглашение отправлено.'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбслуживающаяОрганизацияПриИзменении(Элемент)
	
	ВидПриглашенияЭксперту = ПредопределенноеЗначение("Перечисление.ВидыПриглашений.Эксперту");
	СлужбаПоддержки = ПредопределенноеЗначение("Справочник.ОбслуживающиеОрганизации.СлужбаПоддержки");
	
	Если Объект.ОбслуживающаяОрганизация = СлужбаПоддержки Тогда
		Если Элементы.ВидПриглашения.СписокВыбора.НайтиПоЗначению(ВидПриглашенияЭксперту) = Неопределено Тогда
			Элементы.ВидПриглашения.СписокВыбора.Добавить(ВидПриглашенияЭксперту);
		КонецЕсли; 
	Иначе
		ЭлементВидПриглашенияЭксперту = Элементы.ВидПриглашения.СписокВыбора.НайтиПоЗначению(ВидПриглашенияЭксперту);
		Если ЭлементВидПриглашенияЭксперту <> Неопределено Тогда
			Элементы.ВидПриглашения.СписокВыбора.Удалить(ЭлементВидПриглашенияЭксперту);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтправитьПриглашениеЗавершение(ПараметрыОповещения) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПриглашениеНаСервере()
	
	ПроверитьСоздатьОбновитьПользователя();
    Записать();	
	Документы.ПриглашениеДляРегистрации.ОтправитьПисьмоПоПриглашению(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоздатьОбновитьПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Объект.ПарольПользователя) Тогда
		Объект.ПарольПользователя = Обслуживание.НовыйПароль();
	КонецЕсли; 
		
	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
	Иначе
		ПользовательОбъект = Объект.Пользователь.ПолучитьОбъект(); 
	КонецЕсли; 
	
	ПользовательОбъект.Наименование = Объект.ПолноеИмяПользователя;
	
	ОписаниеПользователяИБ = Новый Структура;
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("Имя", Объект.АдресЭлектроннойПочты);
	ОписаниеПользователяИБ.Вставить("ПолноеИмя", Объект.ПолноеИмяПользователя);
	ОписаниеПользователяИБ.Вставить("Пароль", Объект.ПарольПользователя);
	ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
	ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", Истина);
	ОписаниеПользователяИБ.Вставить("УникальныйИдентификатор", ПользовательОбъект.ИдентификаторПользователяИБ);
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	
	Если ПользовательОбъект.КонтактнаяИнформация.Количество() > 0 Тогда
		КИПочта = ПользовательОбъект.КонтактнаяИнформация[0];
	Иначе
		КИПочта = ПользовательОбъект.КонтактнаяИнформация.Добавить();
		КИПочта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		КИПочта.Вид = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
		КИПочта.АдресЭП = Объект.АдресЭлектроннойПочты;
		КИПочта.Представление = Объект.АдресЭлектроннойПочты;
	КонецЕсли;
	
	ПользовательОбъект.Записать();
	
	СведенияОПользователе = РегистрыСведений.СведенияОПользователях.СоздатьМенеджерЗаписи();
	СведенияОПользователе.Пользователь = ПользовательОбъект.Ссылка;
	СведенияОПользователе.ОбслуживающаяОрганизация = Объект.ОбслуживающаяОрганизация;
	СведенияОПользователе.ЛинияПоддержки = Объект.ЛинияПоддержки;
	СведенияОПользователе.Записать();
	
	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Объект.Пользователь = ПользовательОбъект.Ссылка;
	КонецЕсли;
	
	РеквизитыЛинииПоддержки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ЛинияПоддержки, 
		"ОграничениеДоступаПоКомпонентам, ГруппаМенеджеров, ГруппаКонсультантов, ГруппаЭкспертов");
        
    ОграничениеПоКомпонентам = РеквизитыЛинииПоддержки.ОграничениеДоступаПоКомпонентам;
    Если ТипЗнч(ОграничениеПоКомпонентам) <> Тип("Булево") Тогда
        ОграничениеПоКомпонентам = Ложь;
    КонецЕсли;
    
	Если Объект.ВидПриглашения = Перечисления.ВидыПриглашений.Менеджеру Тогда
        ПолеГруппы = "ГруппаМенеджеров";
    ИначеЕсли Объект.ВидПриглашения = Перечисления.ВидыПриглашений.Консультанту Тогда
        ПолеГруппы = "ГруппаКонсультантов";
	Иначе
        ПолеГруппы = "ГруппаЭкспертов";
	КонецЕсли; 
	
    ГруппаПользователя = ?(ОграничениеПоКомпонентам, РеквизитыЛинииПоддержки[ПолеГруппы], 
        ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбслуживающаяОрганизация, ПолеГруппы));
        
    ГруппаОбъект = ГруппаПользователя.ПолучитьОбъект();
	
	Если ГруппаОбъект.Состав.Найти(Объект.Пользователь, "Пользователь") = Неопределено Тогда
		СтрокаПользователя = ГруппаОбъект.Состав.Добавить();
		СтрокаПользователя.Пользователь = Объект.Пользователь;
		ГруппаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
